examples/01-laminar-pipe/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
#------------------------------------------------------------------------------

blockMesh
icoThermFoam
